tutorials/heatTransfer/chtMultiRegionFoam/heatExchanger/Allrun
#!/data/data/com.termux/files/usr/bin/sh

cd ${0%/*} || exit 1    # Run from this directory

./Allrun.pre

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication $(getApplication)
